In [1]:
import pandas as pd
import numpy as np

In [2]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')

Challenge Questions

1.    Which continent drinks more beer on average?
2.    For each continent print the statistics for wine consumption.
3.    Print the mean alcohol consumption per continent for every column.
4.    Print the median alcohol consumption per continent for every column.

To submit your entries, make a LinkedIn post with a screenshot or PDF of your answers. You can explain your thought process if you'd like. Just make sure to tag the Data in Motion LLC company page.

In [3]:
drinks.info() # Checking contents of data.
# There are some missing values for continent

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [4]:
print("There are %d missing values in the continent columns." % drinks.loc[drinks.continent.isna(),].shape[0])

There are 23 missing values in the continent columns.

Q1. Which continent drinks more beer on average?

In [5]:
pd.pivot_table(drinks, values = 'beer_servings', index = ['continent'], aggfunc=np.sum)

           beer_servings
continent
AF                  3258
AS                  1630
EU                  8720
OC                  1435
SA                  2101

Q2. For each continent print the statistics for wine consumption.

In [6]:
round(drinks.groupby(['continent']).describe()['wine_servings'].T,3)

continent       AF       AS       EU       OC       SA
count       53.000   44.000   45.000   16.000   12.000
mean        16.264    9.068  142.222   35.625   62.417
std         38.846   21.667   97.422   64.556   88.620
min          0.000    0.000    0.000    0.000    1.000
25%          1.000    0.000   59.000    1.000    3.000
50%          2.000    1.000  128.000    8.500   12.000
75%         13.000    8.000  195.000   23.250   98.500
max        233.000  123.000  370.000  212.000  221.000

In [7]:
''' Trying to do TOO MUCH. Since I was able to answer all of the other questions with pivot_tables
I decided to try and make that one tool work. I quickly discover that there was a better way. '''
# print('#'*117)
# print("Wrong Way")

# column_names = ['count', 'mean', 'std', 'min', 'Q3','max']
# wine_pt = pd.pivot_table(drinks, values = 'wine_servings',
#                index = 'continent',
#                aggfunc = ["count",
#                           np.mean, 
#                           np.std, 
#                           'min',  
#                         lambda x: np.percentile(x, 50), 
#                        'max'])

# wine_pt.rename(columns= {wine_pt.columns[0][0]: column_names[0],
#                          wine_pt.columns[1][0]: column_names[1],
#                          wine_pt.columns[2][0]: column_names[2],
#                          wine_pt.columns[3][0]: column_names[3],
#                          wine_pt.columns[4][0]: column_names[4],
#                          wine_pt.columns[5][0]: column_names[5]}).T
# # print('#'*117)

' Trying to do TOO MUCH. Since I was able to answer all of the other questions with pivot_tables\nI decided to try and make that one tool work. I quickly discover that there was a better way. '

Q3 Print the mean alcohol consumption per continent for every column.

In [12]:
mean_al = pd.pivot_table(drinks, values = 'total_litres_of_pure_alcohol',
               index = 'continent',
               aggfunc = np.mean)
mean_al = mean_al.rename(columns = {mean_al.columns[0]:'Mean Alcohol Consumption'})
mean_al

           Mean Alcohol Consumption
continent
AF                         3.007547
AS                         2.170455
EU                         8.617778
OC                         3.381250
SA                         6.308333

Q4 Print the median alcohol consumption per continent for every column.

In [9]:
median_al = pd.pivot_table(drinks, values = 'total_litres_of_pure_alcohol',
               index = 'continent',
               aggfunc = np.median)
median_al.rename(columns = {median_al.columns[0]:'Median Alcohol Consumption'})

           Median Alcohol Consumption
continent
AF                               2.30
AS                               1.20
EU                              10.00
OC                               1.75
SA                               6.85